from django.db import models         # وارد کردن ماژول مدل‌های Django جهت تعریف کلاس‌های مدل



# -------------------------------------------------------
# مدل استان (Province)
# -------------------------------------------------------
class Province(models.Model):
    # فیلد name: نام استان، به‌گونه‌ای که یکتا باشد (هیچ استان با نام تکراری وجود نداشته باشد)
    name = models.CharField(max_length=100, unique=True)  # نام استان


    def __str__(self):
        # نمایش نام استان به عنوان نمایش نمونه (نمایش خواندنی در پنل ادمین و سایر بخش‌ها)
        return self.name


# -------------------------------------------------------
# مدل شهر (City)
# -------------------------------------------------------
class City(models.Model):
    # فیلد province: ارتباط شهر با یک استان از طریق یک کلید خارجی (ForeignKey)
    province = models.ForeignKey(
        Province,
        on_delete=models.CASCADE  # در صورت حذف یک استان، تمامی شهرهای مرتبط نیز حذف می‌شوند
    )  # ارتباط شهر با استان

    # فیلد name: نام شهر، مانند استان محدود به 100 کاراکتر است
    name = models.CharField(max_length=100)  # نام شهر

    def __str__(self):
        # بازگرداندن نام شهر به عنوان نمایش نمونه
        return self.name
